# Sub Region Failures Properties

Source: https://www.revitapidocs.com/2026/be6c21a9-aac0-f484-90f0-051962bbdda8.htm

---

| Sub Region Failures Properties |
| --- |

The BuiltInFailures SubRegionFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CreateSubRegionFailed | Create sub\-division failed. |
|  | NoHostForToposolidSubregion | This sub\-division now does not appear to overlap any Toposolid with an appropriate Phase and Design Option. |
|  | SubDivisionOffsetInvalid | Sub\-division's offset must be less than the thickness of its type. |
|  | SubDivisionPhaseMismatch | Sub\-division must have the same Phase Created parameter and Phase Demolished parameter as the host Toposolid. Sub\-division phase will be set to match the Toposolid. |

Top See Also

#### Reference

BuiltInFailures SubRegionFailures Class Autodesk.Revit.DB Namespace